name: "MobileNet-SSD"
layer {
  name: "data"
  type: "AnnotatedData"
  top: "data"
  top: "label"
  include {
    phase: TRAIN
  }
  transform_param {
    scale: 0.007843
    mirror: true
    mean_value: 127.5
    mean_value: 127.5
    mean_value: 127.5
    resize_param {
      prob: 1
      resize_mode: WARP
      height: 300
      width: 300
      interp_mode: LINEAR
      interp_mode: AREA
      interp_mode: NEAREST
      interp_mode: CUBIC
      interp_mode: LANCZOS4
    }
    emit_constraint {
      emit_type: CENTER
    }
    distort_param {
      brightness_prob: 0.5
      brightness_delta: 32
      contrast_prob: 0.5
      contrast_lower: 0.5
      contrast_upper: 1.5
      hue_prob: 0.5
      hue_delta: 18
      saturation_prob: 0.5
      saturation_lower: 0.5
      saturation_upper: 1.5
      random_order_prob: 0
    }
    expand_param {
      prob: 0.5
      max_expand_ratio: 4
    }
  }
  data_param {
    source: "data/VOCdevkit/VOC0712/lmdb/VOC0712_trainval_lmdb"
    batch_size: 8
    backend: LMDB
  }
  annotated_data_param {
    batch_sampler {
      max_sample: 1
      max_trials: 1
    }
    batch_sampler {
      sampler {
        min_scale: 0.3
        max_scale: 1
        min_aspect_ratio: 0.5
        max_aspect_ratio: 2
      }
      sample_constraint {
        min_jaccard_overlap: 0.1
      }
      max_sample: 1
      max_trials: 50
    }
    batch_sampler {
      sampler {
        min_scale: 0.3
        max_scale: 1
        min_aspect_ratio: 0.5
        max_aspect_ratio: 2
      }
      sample_constraint {
        min_jaccard_overlap: 0.3
      }
      max_sample: 1
      max_trials: 50
    }
    batch_sampler {
      sampler {
        min_scale: 0.3
        max_scale: 1
        min_aspect_ratio: 0.5
        max_aspect_ratio: 2
      }
      sample_constraint {
        min_jaccard_overlap: 0.5
      }
      max_sample: 1
      max_trials: 50
    }
    batch_sampler {
      sampler {
        min_scale: 0.3
        max_scale: 1
        min_aspect_ratio: 0.5
        max_aspect_ratio: 2
      }
      sample_constraint {
        min_jaccard_overlap: 0.7
      }
      max_sample: 1
      max_trials: 50
    }
    batch_sampler {
      sampler {
        min_scale: 0.3
        max_scale: 1
        min_aspect_ratio: 0.5
        max_aspect_ratio: 2
      }
      sample_constraint {
        min_jaccard_overlap: 0.9
      }
      max_sample: 1
      max_trials: 50
    }
    batch_sampler {
      sampler {
        min_scale: 0.3
        max_scale: 1
        min_aspect_ratio: 0.5
        max_aspect_ratio: 2
      }
      sample_constraint {
        max_jaccard_overlap: 1
      }
      max_sample: 1
      max_trials: 50
    }
    label_map_file: "data/VOC0712/labelmap_voc.prototxt"
  }
}
layer {
  name: "data"
  type: "AnnotatedData"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  transform_param {
    scale: 0.007843
    mean_value: 127.5
    mean_value: 127.5
    mean_value: 127.5
    resize_param {
      prob: 1
      resize_mode: WARP
      height: 300
      width: 300
      interp_mode: LINEAR
    }
  }
  data_param {
    source: "data/VOCdevkit/VOC0712/lmdb/VOC0712_test_lmdb"
    batch_size: 8
    backend: LMDB
  }
  annotated_data_param {
    batch_sampler {
    }
    label_map_file: "data/VOC0712/labelmap_voc.prototxt"
  }
}
layer {
  name: "conv0"
  type: "ConvolutionRistretto"
  bottom: "data"
  top: "conv0"
  param {
    lr_mult: 0.1
    decay_mult: 0.1
  }
  convolution_param {
    num_output: 32
    bias_term: true
    pad: 1
    kernel_size: 3
    stride: 2
    weight_filler {
      type: "msra"
    }
  }
  quantization_param {
    weight_scale: 106.81248
    weight_scale: 0
    weight_scale: 0
    weight_scale: 0
    weight_scale: 0
    weight_scale: 401.16254
    weight_scale: 347.167
    weight_scale: 0
    weight_scale: 0
    weight_scale: 0
    weight_scale: 119.29459
    weight_scale: 234.92451
    weight_scale: 192.60979
    weight_scale: 0
    weight_scale: 27.134331
    weight_scale: 145.0318
    weight_scale: 212.23625
    weight_scale: 0
    weight_scale: 234.09517
    weight_scale: 84.812347
    weight_scale: 50.996887
    weight_scale: 36.014729
    weight_scale: 0
    weight_scale: 0
    weight_scale: 104.75785
    weight_scale: 62.681759
    weight_scale: 0
    weight_scale: 113.08671
    weight_scale: 74.019745
    weight_scale: 0
    weight_scale: 0
    weight_scale: 433.83237
    data_scale: 127.09531
    int8_term: true
  }
}
layer {
  name: "conv0/relu"
  type: "ReLU"
  bottom: "conv0"
  top: "conv0"
}
layer {
  name: "conv1/dw"
  type: "ConvolutionRistretto"
  bottom: "conv0"
  top: "conv1/dw"
  param {
    lr_mult: 0.1
    decay_mult: 0.1
  }
  convolution_param {
    num_output: 32
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 32
    weight_filler {
      type: "msra"
    }
  }
  quantization_param {
    weight_scale: 42.069221
    weight_scale: 0
    weight_scale: 0
    weight_scale: 0
    weight_scale: 0
    weight_scale: 35.984802
    weight_scale: 96.115616
    weight_scale: 0
    weight_scale: 0
    weight_scale: 0
    weight_scale: 48.488396
    weight_scale: 35.077381
    weight_scale: 35.616371
    weight_scale: 0
    weight_scale: 52.942394
    weight_scale: 75.959213
    weight_scale: 37.772625
    weight_scale: 0
    weight_scale: 23.294437
    weight_scale: 41.653629
    weight_scale: 74.393326
    weight_scale: 114.59215
    weight_scale: 0
    weight_scale: 0
    weight_scale: 58.052208
    weight_scale: 32.906918
    weight_scale: 0
    weight_scale: 36.666779
    weight_scale: 76.182823
    weight_scale: 0
    weight_scale: 0
    weight_scale: 23.983231
    data_scale: 12.140777
    int8_term: true
  }
}
layer {
  name: "conv1/dw/relu"
  type: "ReLU"
  bottom: "conv1/dw"
  top: "conv1/dw"
}
layer {
  name: "conv1"
  type: "ConvolutionRistretto"
  bottom: "conv1/dw"
  top: "conv1"
  param {
    lr_mult: 0.1
    decay_mult: 0.1
  }
  convolution_param {
    num_output: 64
    bias_term: true
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
  }
  quantization_param {
    weight_scale: 62.296791
    weight_scale: 340.00919
    weight_scale: 244.76463
    weight_scale: 114.33263
    weight_scale: 111.08422
    weight_scale: 48.325081
    weight_scale: 276.69028
    weight_scale: 649.94672
    weight_scale: 136.88058
    weight_scale: 230.25952
    weight_scale: 226.49147
    weight_scale: 199.63239
    weight_scale: 58.715031
    weight_scale: 312.99686
    weight_scale: 215.02881
    weight_scale: 233.23135
    weight_scale: 37.170033
    weight_scale: 236.88872
    weight_scale: 602.86835
    weight_scale: 111.41103
    weight_scale: 297.32446
    weight_scale: 157.18501
    weight_scale: 21.942568
    weight_scale: 251.11304
    weight_scale: 250.05495
    weight_scale: 95.993233
    weight_scale: 101.7088
    weight_scale: 257.06219
    weight_scale: 371.84647
    weight_scale: 742.45123
    weight_scale: 202.48749
    weight_scale: 32.184006
    weight_scale: 173.09358
    weight_scale: 148.45215
    weight_scale: 244.76071
    weight_scale: 65.304459
    weight_scale: 516.90668
    weight_scale: 326.26028
    weight_scale: 81.105789
    weight_scale: 232.79234
    weight_scale: 95.468948
    weight_scale: 168.81299
    weight_scale: 176.63297
    weight_scale: 138.76331
    weight_scale: 48.499596
    weight_scale: 5453.7466
    weight_scale: 234.62126
    weight_scale: 105.88915
    weight_scale: 263.12778
    weight_scale: 186.40556
    weight_scale: 159.8394
    weight_scale: 44.435413
    weight_scale: 0
    weight_scale: 37.818382
    weight_scale: 52.843052
    weight_scale: 129.14526
    weight_scale: 115.61911
    weight_scale: 283.58841
    weight_scale: 512.38123
    weight_scale: 323.9176
    weight_scale: 30.732515
    weight_scale: 231.78539
    weight_scale: 38.860786
    weight_scale: 120.72556
    data_scale: 7.7601585
    int8_term: true
  }
}
layer {
  name: "conv1/relu"
  type: "ReLU"
  bottom: "conv1"
  top: "conv1"
}
layer {
  name: "conv2/dw"
  type: "ConvolutionRistretto"
  bottom: "conv1"
  top: "conv2/dw"
  param {
    lr_mult: 0.1
    decay_mult: 0.1
  }
  convolution_param {
    num_output: 64
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 64
    stride: 2
    weight_filler {
      type: "msra"
    }
  }
  quantization_param {
    weight_scale: 439.58237
    weight_scale: 60.190319
    weight_scale: 83.545586
    weight_scale: 485.68866
    weight_scale: 369.8826
    weight_scale: 995.15314
    weight_scale: 77.806839
    weight_scale: 19.692831
    weight_scale: 453.72263
    weight_scale: 76.307472
    weight_scale: 401.45593
    weight_scale: 94.955856
    weight_scale: 244.56512
    weight_scale: 226.90028
    weight_scale: 375.83087
    weight_scale: 169.79877
    weight_scale: 1268.0333
    weight_scale: 266.88034
    weight_scale: 28.242653
    weight_scale: 508.96893
    weight_scale: 344.37924
    weight_scale: 101.71627
    weight_scale: 460.50638
    weight_scale: 253.09245
    weight_scale: 323.43686
    weight_scale: 305.57693
    weight_scale: 578.44574
    weight_scale: 285.32764
    weight_scale: 273.30673
    weight_scale: 177.76729
    weight_scale: 227.42879
    weight_scale: 1689.7675
    weight_scale: 384.92477
    weight_scale: 437.61188
    weight_scale: 243.39003
    weight_scale: 815.49939
    weight_scale: 127.46946
    weight_scale: 384.2587
    weight_scale: 568.59882
    weight_scale: 157.37007
    weight_scale: 412.19876
    weight_scale: 290.02237
    weight_scale: 325.13681
    weight_scale: 598.47229
    weight_scale: 1249.1615
    weight_scale: 58.587982
    weight_scale: 211.27534
    weight_scale: 181.552
    weight_scale: 236.32339
    weight_scale: 181.68826
    weight_scale: 403.46729
    weight_scale: 643.55286
    weight_scale: 0
    weight_scale: 743.26697
    weight_scale: 838.12396
    weight_scale: 398.56262
    weight_scale: 359.09641
    weight_scale: 292.13565
    weight_scale: 178.2281
    weight_scale: 243.21791
    weight_scale: 1868.042
    weight_scale: 364.39868
    weight_scale: 1672.4285
    weight_scale: 152.04114
    data_scale: 2.0261784
    int8_term: true
  }
}
layer {
  name: "conv2/dw/relu"
  type: "ReLU"
  bottom: "conv2/dw"
  top: "conv2/dw"
}
layer {
  name: "conv2"
  type: "ConvolutionRistretto"
  bottom: "conv2/dw"
  top: "conv2"
  param {
    lr_mult: 0.1
    decay_mult: 0.1
  }
  convolution_param {
    num_output: 128
    bias_term: true
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
  }
  quantization_param {
    weight_scale: 96.467
    weight_scale: 105.04046
    weight_scale: 145.78905
    weight_scale: 255.59593
    weight_scale: 92.149635
    weight_scale: 260.55716
    weight_scale: 229.17281
    weight_scale: 48.8967
    weight_scale: 847.93311
    weight_scale: 181.33414
    weight_scale: 260.43964
    weight_scale: 215.58652
    weight_scale: 316.81769
    weight_scale: 383.81406
    weight_scale: 472.05313
    weight_scale: 732.63324
    weight_scale: 416.58325
    weight_scale: 108.33121
    weight_scale: 129.28577
    weight_scale: 0
    weight_scale: 405.41724
    weight_scale: 123.05182
    weight_scale: 240.84583
    weight_scale: 508.22034
    weight_scale: 166.01408
    weight_scale: 352.96109
    weight_scale: 237.21098
    weight_scale: 102.24736
    weight_scale: 135.14816
    weight_scale: 147.43819
    weight_scale: 194.56483
    weight_scale: 369.39886
    weight_scale: 659.06079
    weight_scale: 319.7988
    weight_scale: 170.26674
    weight_scale: 217.11723
    weight_scale: 128.09961
    weight_scale: 251.6272
    weight_scale: 198.43109
    weight_scale: 195.71867
    weight_scale: 186.83511
    weight_scale: 332.07825
    weight_scale: 326.97574
    weight_scale: 290.7196
    weight_scale: 781.77771
    weight_scale: 221.59157
    weight_scale: 308.16684
    weight_scale: 369.75104
    weight_scale: 174.56204
    weight_scale: 471.77469
    weight_scale: 99.521362
    weight_scale: 172.08472
    weight_scale: 153.52481
    weight_scale: 604.43884
    weight_scale: 598.4248
    weight_scale: 332.31937
    weight_scale: 266.6282
    weight_scale: 255.89461
    weight_scale: 282.59906
    weight_scale: 557.74524
    weight_scale: 97.028221
    weight_scale: 354.80267
    weight_scale: 453.80246
    weight_scale: 319.80127
    weight_scale: 125.33324
    weight_scale: 74.923218
    weight_scale: 0
    weight_scale: 367.07349
    weight_scale: 233.49496
    weight_scale: 87.656342
    weight_scale: 99.8602
    weight_scale: 141.50027
    weight_scale: 181.69649
    weight_scale: 62.819298
    weight_scale: 327.56451
    weight_scale: 273.14304
    weight_scale: 350.88184
    weight_scale: 345.41443
    weight_scale: 105.27074
    weight_scale: 374.06409
    weight_scale: 695.5174
    weight_scale: 239.51041
    weight_scale: 203.17361
    weight_scale: 145.67886
    weight_scale: 159.13251
    weight_scale: 345.05603
    weight_scale: 121.60563
    weight_scale: 173.20395
    weight_scale: 119.77904
    weight_scale: 0
    weight_scale: 229.05347
    weight_scale: 223.95172
    weight_scale: 210.76773
    weight_scale: 127.83851
    weight_scale: 198.0536
    weight_scale: 501.28867
    weight_scale: 487.92392
    weight_scale: 431.15494
    weight_scale: 50.180893
    weight_scale: 307.4595
    weight_scale: 312.48685
    weight_scale: 148.76089
    weight_scale: 208.76176
    weight_scale: 406.27365
    weight_scale: 822.07452
    weight_scale: 285.95932
    weight_scale: 259.80478
    weight_scale: 52.228962
    weight_scale: 163.91852
    weight_scale: 64.735756
    weight_scale: 79.161186
    weight_scale: 556.81036
    weight_scale: 119.342
    weight_scale: 167.20781
    weight_scale: 316.03275
    weight_scale: 193.64864
    weight_scale: 126.40026
    weight_scale: 511.05771
    weight_scale: 78.837395
    weight_scale: 148.29942
    weight_scale: 537.87146
    weight_scale: 94.268761
    weight_scale: 308.36426
    weight_scale: 133.07175
    weight_scale: 55.999935
    weight_scale: 0
    weight_scale: 183.20195
    weight_scale: 509.39594
    data_scale: 12.320522
    int8_term: true
  }
}
layer {
  name: "conv2/relu"
  type: "ReLU"
  bottom: "conv2"
  top: "conv2"
}
layer {
  name: "conv3/dw"
  type: "ConvolutionRistretto"
  bottom: "conv2"
  top: "conv3/dw"
  param {
    lr_mult: 0.1
    decay_mult: 0.1
  }
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 128
    weight_filler {
      type: "msra"
    }
  }
  quantization_param {
    weight_scale: 90.748741
    weight_scale: 158.82716
    weight_scale: 184.419
    weight_scale: 88.538239
    weight_scale: 146.60097
    weight_scale: 61.966255
    weight_scale: 133.29471
    weight_scale: 273.19821
    weight_scale: 50.887882
    weight_scale: 134.83469
    weight_scale: 73.516418
    weight_scale: 66.038956
    weight_scale: 35.718063
    weight_scale: 50.901028
    weight_scale: 100.85236
    weight_scale: 29.334551
    weight_scale: 63.975857
    weight_scale: 60.080509
    weight_scale: 71.942764
    weight_scale: 0
    weight_scale: 39.907898
    weight_scale: 161.25491
    weight_scale: 46.822533
    weight_scale: 48.830261
    weight_scale: 76.549744
    weight_scale: 58.755157
    weight_scale: 27.693878
    weight_scale: 120.54072
    weight_scale: 94.1268
    weight_scale: 86.394768
    weight_scale: 174.21132
    weight_scale: 106.03585
    weight_scale: 78.862961
    weight_scale: 57.77243
    weight_scale: 146.40828
    weight_scale: 68.201843
    weight_scale: 180.58226
    weight_scale: 165.41666
    weight_scale: 138.58177
    weight_scale: 114.14324
    weight_scale: 80.554382
    weight_scale: 844.64197
    weight_scale: 63.943043
    weight_scale: 51.349472
    weight_scale: 32.852303
    weight_scale: 118.22345
    weight_scale: 48.242203
    weight_scale: 45.262177
    weight_scale: 165.30823
    weight_scale: 34.388554
    weight_scale: 123.68927
    weight_scale: 114.43339
    weight_scale: 47.356586
    weight_scale: 46.351933
    weight_scale: 59.14735
    weight_scale: 66.488556
    weight_scale: 45.375385
    weight_scale: 30.083931
    weight_scale: 50.015347
    weight_scale: 46.384438
    weight_scale: 169.6162
    weight_scale: 37.062878
    weight_scale: 21.439035
    weight_scale: 57.248875
    weight_scale: 95.3132
    weight_scale: 147.61208
    weight_scale: 0
    weight_scale: 44.665066
    weight_scale: 70.2968
    weight_scale: 93.036293
    weight_scale: 67.954781
    weight_scale: 272.18893
    weight_scale: 103.36976
    weight_scale: 355.34494
    weight_scale: 50.347706
    weight_scale: 29.65587
    weight_scale: 64.868912
    weight_scale: 55.939892
    weight_scale: 269.85513
    weight_scale: 26.84449
    weight_scale: 34.850197
    weight_scale: 64.546242
    weight_scale: 299.27551
    weight_scale: 121.35434
    weight_scale: 55.998005
    weight_scale: 26.430338
    weight_scale: 107.3002
    weight_scale: 161.12891
    weight_scale: 141.03583
    weight_scale: 0
    weight_scale: 87.395187
    weight_scale: 141.26276
    weight_scale: 62.269093
    weight_scale: 130.15219
    weight_scale: 103.39922
    weight_scale: 27.818277
    weight_scale: 51.55238
    weight_scale: 44.146626
    weight_scale: 435.17432
    weight_scale: 73.464577
    weight_scale: 55.226276
    weight_scale: 35.22039
    weight_scale: 100.92853
    weight_scale: 63.92466
    weight_scale: 48.549538
    weight_scale: 66.205215
    weight_scale: 58.754833
    weight_scale: 609.56647
    weight_scale: 142.46901
    weight_scale: 247.75555
    weight_scale: 127.70506
    weight_scale: 47.180248
    weight_scale: 215.25522
    weight_scale: 267.43512
    weight_scale: 98.902367
    weight_scale: 74.938759
    weight_scale: 118.47475
    weight_scale: 73.441666
    weight_scale: 586.95496
    weight_scale: 186.19742
    weight_scale: 23.014063
    weight_scale: 165.28926
    weight_scale: 86.505981
    weight_scale: 110.25916
    weight_scale: 120.13366
    weight_scale: 0
    weight_scale: 186.12479
    weight_scale: 90.502319
    data_scale: 4.2913885
    int8_term: true
  }
}
layer {
  name: "conv3/dw/relu"
  type: "ReLU"
  bottom: "conv3/dw"
  top: "conv3/dw"
}
layer {
  name: "conv3"
  type: "ConvolutionRistretto"
  bottom: "conv3/dw"
  top: "conv3"
  param {
    lr_mult: 0.1
    decay_mult: 0.1
  }
  convolution_param {
    num_output: 128
    bias_term: true
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
  }
  quantization_param {
    weight_scale: 452.3909
    weight_scale: 405.67184
    weight_scale: 362.73285
    weight_scale: 417.93423
    weight_scale: 236.34644
    weight_scale: 240.00009
    weight_scale: 283.88492
    weight_scale: 569.50293
    weight_scale: 265.19211
    weight_scale: 737.54456
    weight_scale: 229.48413
    weight_scale: 141.14568
    weight_scale: 251.81682
    weight_scale: 215.71973
    weight_scale: 309.09991
    weight_scale: 295.18878
    weight_scale: 672.67377
    weight_scale: 248.01599
    weight_scale: 498.6752
    weight_scale: 647.86145
    weight_scale: 353.69336
    weight_scale: 398.09097
    weight_scale: 223.13821
    weight_scale: 535.98273
    weight_scale: 271.68423
    weight_scale: 329.77838
    weight_scale: 468.30881
    weight_scale: 269.00833
    weight_scale: 297.42877
    weight_scale: 333.01291
    weight_scale: 428.81912
    weight_scale: 342.25565
    weight_scale: 0
    weight_scale: 505.89426
    weight_scale: 438.39594
    weight_scale: 83.080055
    weight_scale: 361.43472
    weight_scale: 584.28046
    weight_scale: 165.74178
    weight_scale: 285.98032
    weight_scale: 300.94531
    weight_scale: 708.82843
    weight_scale: 242.17033
    weight_scale: 270.70242
    weight_scale: 232.41432
    weight_scale: 418.93765
    weight_scale: 306.57422
    weight_scale: 297.83493
    weight_scale: 430.63327
    weight_scale: 140.0015
    weight_scale: 398.30145
    weight_scale: 383.39203
    weight_scale: 257.17093
    weight_scale: 236.88481
    weight_scale: 202.94571
    weight_scale: 160.55429
    weight_scale: 383.95947
    weight_scale: 387.01016
    weight_scale: 224.97682
    weight_scale: 167.8575
    weight_scale: 797.40991
    weight_scale: 117.77711
    weight_scale: 146.14421
    weight_scale: 489.11218
    weight_scale: 335.30814
    weight_scale: 368.19321
    weight_scale: 265.28882
    weight_scale: 545.71393
    weight_scale: 224.78502
    weight_scale: 282.2894
    weight_scale: 366.73767
    weight_scale: 237.20071
    weight_scale: 329.964
    weight_scale: 271.086
    weight_scale: 540.62744
    weight_scale: 226.95285
    weight_scale: 244.65477
    weight_scale: 359.11472
    weight_scale: 273.55933
    weight_scale: 621.43005
    weight_scale: 630.46832
    weight_scale: 81.097313
    weight_scale: 481.14642
    weight_scale: 258.98917
    weight_scale: 299.98019
    weight_scale: 53.386482
    weight_scale: 496.58743
    weight_scale: 459.04474
    weight_scale: 212.28818
    weight_scale: 278.2916
    weight_scale: 384.63068
    weight_scale: 48.847919
    weight_scale: 214.84413
    weight_scale: 107.47992
    weight_scale: 226.99516
    weight_scale: 315.89011
    weight_scale: 323.47266
    weight_scale: 232.91309
    weight_scale: 294.67548
    weight_scale: 396.98346
    weight_scale: 432.88907
    weight_scale: 1756.646
    weight_scale: 357.43738
    weight_scale: 554.59058
    weight_scale: 276.58963
    weight_scale: 337.53656
    weight_scale: 72.555023
    weight_scale: 271.36032
    weight_scale: 195.50926
    weight_scale: 203.79285
    weight_scale: 227.63564
    weight_scale: 176.98073
    weight_scale: 319.17343
    weight_scale: 304.17081
    weight_scale: 303.07724
    weight_scale: 58.609306
    weight_scale: 425.71469
    weight_scale: 363.54089
    weight_scale: 574.89844
    weight_scale: 638.65033
    weight_scale: 464.22241
    weight_scale: 239.39497
    weight_scale: 220.11694
    weight_scale: 366.4425
    weight_scale: 230.35191
    weight_scale: 227.69781
    weight_scale: 208.61186
    weight_scale: 266.35388
    data_scale: 4.29569
    int8_term: true
  }
}
layer {
  name: "conv3/relu"
  type: "ReLU"
  bottom: "conv3"
  top: "conv3"
}
layer {
  name: "conv4/dw"
  type: "ConvolutionRistretto"
  bottom: "conv3"
  top: "conv4/dw"
  param {
    lr_mult: 0.1
    decay_mult: 0.1
  }
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 128
    stride: 2
    weight_filler {
      type: "msra"
    }
  }
  quantization_param {
    weight_scale: 124.40422
    weight_scale: 153.7234
    weight_scale: 361.83585
    weight_scale: 179.10188
    weight_scale: 194.3033
    weight_scale: 434.32275
    weight_scale: 200.87878
    weight_scale: 130.18175
    weight_scale: 179.55775
    weight_scale: 203.98366
    weight_scale: 456.70798
    weight_scale: 221.21671
    weight_scale: 624.08997
    weight_scale: 227.53357
    weight_scale: 257.1395
    weight_scale: 363.19144
    weight_scale: 135.77098
    weight_scale: 217.94643
    weight_scale: 184.47537
    weight_scale: 181.88266
    weight_scale: 243.25455
    weight_scale: 182.07985
    weight_scale: 684.47589
    weight_scale: 250.02736
    weight_scale: 330.00778
    weight_scale: 197.70772
    weight_scale: 373.21558
    weight_scale: 251.28401
    weight_scale: 937.05182
    weight_scale: 309.25446
    weight_scale: 162.71407
    weight_scale: 146.56255
    weight_scale: 0
    weight_scale: 197.34091
    weight_scale: 265.39261
    weight_scale: 1187.3105
    weight_scale: 322.13757
    weight_scale: 183.70149
    weight_scale: 312.89798
    weight_scale: 338.75446
    weight_scale: 380.42
    weight_scale: 278.5495
    weight_scale: 485.75763
    weight_scale: 390.98666
    weight_scale: 213.66296
    weight_scale: 251.10274
    weight_scale: 386.70044
    weight_scale: 139.41145
    weight_scale: 183.66014
    weight_scale: 483.97168
    weight_scale: 304.78018
    weight_scale: 175.62665
    weight_scale: 247.28758
    weight_scale: 498.61041
    weight_scale: 516.42969
    weight_scale: 713.422
    weight_scale: 503.87595
    weight_scale: 349.50247
    weight_scale: 167.92551
    weight_scale: 675.03662
    weight_scale: 151.73883
    weight_scale: 326.86896
    weight_scale: 256.46719
    weight_scale: 258.45309
    weight_scale: 138.93715
    weight_scale: 302.69467
    weight_scale: 132.66818
    weight_scale: 130.55655
    weight_scale: 307.55188
    weight_scale: 171.58658
    weight_scale: 244.24478
    weight_scale: 183.08377
    weight_scale: 253.09366
    weight_scale: 360.72498
    weight_scale: 280.97849
    weight_scale: 475.68015
    weight_scale: 323.01093
    weight_scale: 315.28027
    weight_scale: 512.4519
    weight_scale: 208.9111
    weight_scale: 158.84659
    weight_scale: 739.04852
    weight_scale: 259.05865
    weight_scale: 344.23209
    weight_scale: 142.47005
    weight_scale: 981.12274
    weight_scale: 203.15001
    weight_scale: 414.25055
    weight_scale: 306.57947
    weight_scale: 287.82339
    weight_scale: 282.49622
    weight_scale: 1962.5276
    weight_scale: 347.4209
    weight_scale: 437.51596
    weight_scale: 262.15207
    weight_scale: 448.16986
    weight_scale: 787.22589
    weight_scale: 269.39719
    weight_scale: 422.74344
    weight_scale: 428.62354
    weight_scale: 227.84286
    weight_scale: 90.54303
    weight_scale: 236.98447
    weight_scale: 228.90723
    weight_scale: 235.58888
    weight_scale: 252.81978
    weight_scale: 349.41537
    weight_scale: 403.01279
    weight_scale: 311.87991
    weight_scale: 452.53439
    weight_scale: 356.43097
    weight_scale: 139.25711
    weight_scale: 189.56937
    weight_scale: 187.50208
    weight_scale: 127.35973
    weight_scale: 2092.6956
    weight_scale: 143.44536
    weight_scale: 356.60071
    weight_scale: 242.84943
    weight_scale: 193.1344
    weight_scale: 228.66418
    weight_scale: 237.5213
    weight_scale: 228.88596
    weight_scale: 267.5976
    weight_scale: 535.24176
    weight_scale: 415.47638
    weight_scale: 205.40984
    weight_scale: 290.892
    data_scale: 2.7933271
    int8_term: true
  }
}
layer {
  name: "conv4/dw/relu"
  type: "ReLU"
  bottom: "conv4/dw"
  top: "conv4/dw"
}
layer {
  name: "conv4"
  type: "ConvolutionRistretto"
  bottom: "conv4/dw"
  top: "conv4"
  param {
    lr_mult: 0.1
    decay_mult: 0.1
  }
  convolution_param {
    num_output: 256
    bias_term: true
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
  }
  quantization_param {
    weight_scale: 380.73972
    weight_scale: 473.19211
    weight_scale: 514.31909
    weight_scale: 354.91006
    weight_scale: 595.19122
    weight_scale: 293.0719
    weight_scale: 221.10115
    weight_scale: 382.38049
    weight_scale: 224.18875
    weight_scale: 618.49091
    weight_scale: 658.59277
    weight_scale: 278.50473
    weight_scale: 381.68933
    weight_scale: 247.76996
    weight_scale: 160.0399
    weight_scale: 271.39258
    weight_scale: 143.72964
    weight_scale: 224.38293
    weight_scale: 432.40695
    weight_scale: 156.61049
    weight_scale: 448.30518
    weight_scale: 635.65063
    weight_scale: 444.64233
    weight_scale: 785.13977
    weight_scale: 275.70612
    weight_scale: 794.00714
    weight_scale: 307.24573
    weight_scale: 124.07317
    weight_scale: 289.5047
    weight_scale: 321.58377
    weight_scale: 390.89581
    weight_scale: 323.06436
    weight_scale: 270.66794
    weight_scale: 152.35193
    weight_scale: 174.02238
    weight_scale: 264.03049
    weight_scale: 455.14261
    weight_scale: 514.60742
    weight_scale: 615.25482
    weight_scale: 226.52818
    weight_scale: 1027.8228
    weight_scale: 594.13879
    weight_scale: 129.37109
    weight_scale: 160.42404
    weight_scale: 271.37439
    weight_scale: 882.11938
    weight_scale: 224.82286
    weight_scale: 97.06852
    weight_scale: 709.8028
    weight_scale: 1129.7751
    weight_scale: 779.73865
    weight_scale: 380.24609
    weight_scale: 212.72339
    weight_scale: 366.72937
    weight_scale: 244.02567
    weight_scale: 286.12729
    weight_scale: 233.35362
    weight_scale: 598.37616
    weight_scale: 202.73103
    weight_scale: 484.04053
    weight_scale: 507.09378
    weight_scale: 569.77991
    weight_scale: 743.12872
    weight_scale: 150.32629
    weight_scale: 319.81659
    weight_scale: 535.99072
    weight_scale: 717.06964
    weight_scale: 413.04648
    weight_scale: 401.93805
    weight_scale: 207.53833
    weight_scale: 279.48474
    weight_scale: 213.72462
    weight_scale: 315.71249
    weight_scale: 72.438339
    weight_scale: 190.35692
    weight_scale: 691.25391
    weight_scale: 519.53528
    weight_scale: 308.97452
    weight_scale: 1134.2228
    weight_scale: 257.33057
    weight_scale: 340.97897
    weight_scale: 2279.7378
    weight_scale: 441.67642
    weight_scale: 207.13643
    weight_scale: 171.94243
    weight_scale: 447.60306
    weight_scale: 130.15894
    weight_scale: 329.27267
    weight_scale: 494.04227
    weight_scale: 253.56816
    weight_scale: 423.88916
    weight_scale: 268.37671
    weight_scale: 784.65417
    weight_scale: 242.13303
    weight_scale: 1036.9675
    weight_scale: 243.37732
    weight_scale: 693.62921
    weight_scale: 391.84415
    weight_scale: 1001.8126
    weight_scale: 309.81317
    weight_scale: 296.63184
    weight_scale: 403.93643
    weight_scale: 441.38162
    weight_scale: 202.64076
    weight_scale: 428.76468
    weight_scale: 200.57906
    weight_scale: 181.8008
    weight_scale: 207.85419
    weight_scale: 686.34662
    weight_scale: 293.5394
    weight_scale: 357.0488
    weight_scale: 568.094
    weight_scale: 168.83224
    weight_scale: 404.63467
    weight_scale: 318.76297
    weight_scale: 574.47589
    weight_scale: 243.74745
    weight_scale: 291.52509
    weight_scale: 421.14108
    weight_scale: 211.12755
    weight_scale: 537.16437
    weight_scale: 275.6658
    weight_scale: 620.06738
    weight_scale: 260.27444
    weight_scale: 436.41489
    weight_scale: 409.97092
    weight_scale: 866.65948
    weight_scale: 838.45142
    weight_scale: 230.02391
    weight_scale: 392.13916
    weight_scale: 484.79047
    weight_scale: 127.27453
    weight_scale: 448.80481
    weight_scale: 349.66962
    weight_scale: 348.67526
    weight_scale: 289.57971
    weight_scale: 103.68752
    weight_scale: 196.05211
    weight_scale: 397.45172
    weight_scale: 302.07703
    weight_scale: 550.31793
    weight_scale: 524.35193
    weight_scale: 593.09314
    weight_scale: 779.3562
    weight_scale: 389.1283
    weight_scale: 378.4295
    weight_scale: 380.4559
    weight_scale: 623.12238
    weight_scale: 168.68304
    weight_scale: 460.2428
    weight_scale: 895.34235
    weight_scale: 236.98604
    weight_scale: 478.91214
    weight_scale: 276.18777
    weight_scale: 372.57639
    weight_scale: 295.15582
    weight_scale: 201.95341
    weight_scale: 524.75867
    weight_scale: 317.63522
    weight_scale: 310.81671
    weight_scale: 277.23648
    weight_scale: 527.6908
    weight_scale: 160.45688
    weight_scale: 358.42856
    weight_scale: 241.62471
    weight_scale: 736.21906
    weight_scale: 154.90677
    weight_scale: 282.15253
    weight_scale: 351.29193
    weight_scale: 174.21184
    weight_scale: 375.37241
    weight_scale: 374.5452
    weight_scale: 366.2106
    weight_scale: 449.32639
    weight_scale: 203.95749
    weight_scale: 436.67383
    weight_scale: 138.09737
    weight_scale: 555.32996
    weight_scale: 862.94965
    weight_scale: 434.34741
    weight_scale: 217.87128
    weight_scale: 284.51779
    weight_scale: 281.98697
    weight_scale: 326.02982
    weight_scale: 200.28763
    weight_scale: 1402.1476
    weight_scale: 583.40204
    weight_scale: 477.17554
    weight_scale: 785.43933
    weight_scale: 369.01343
    weight_scale: 500.76181
    weight_scale: 300.78748
    weight_scale: 466.92316
    weight_scale: 287.45163
    weight_scale: 602.73303
    weight_scale: 611.54437
    weight_scale: 329.36838
    weight_scale: 204.14015
    weight_scale: 586.26819
    weight_scale: 331.73874
    weight_scale: 802.93787
    weight_scale: 278.48743
    weight_scale: 170.02304
    weight_scale: 367.96582
    weight_scale: 492.77643
    weight_scale: 800.69086
    weight_scale: 1107.7224
    weight_scale: 347.03702
    weight_scale: 221.23026
    weight_scale: 379.30875
    weight_scale: 218.30879
    weight_scale: 349.63736
    weight_scale: 470.9003
    weight_scale: 318.45013
    weight_scale: 462.90903
    weight_scale: 275.09537
    weight_scale: 614.22626
    weight_scale: 832.33722
    weight_scale: 385.64722
    weight_scale: 333.53177
    weight_scale: 364.76508
    weight_scale: 493.09006
    weight_scale: 266.258
    weight_scale: 181.01382
    weight_scale: 326.33582
    weight_scale: 279.28973
    weight_scale: 549.38641
    weight_scale: 802.08722
    weight_scale: 550.1087
    weight_scale: 545.24292
    weight_scale: 1001.9037
    weight_scale: 263.73819
    weight_scale: 492.13284
    weight_scale: 429.91629
    weight_scale: 465.93771
    weight_scale: 292.68176
    weight_scale: 412.58136
    weight_scale: 569.34882
    weight_scale: 646.31073
    weight_scale: 445.97086
    weight_scale: 292.73373
    weight_scale: 399.7738
    weight_scale: 457.09473
    weight_scale: 285.80359
    weight_scale: 277.16187
    weight_scale: 263.79358
    weight_scale: 242.04057
    weight_scale: 354.69711
    weight_scale: 186.04391
    weight_scale: 372.3002
    weight_scale: 365.96133
    weight_scale: 508.69165
    weight_scale: 90.88942
    weight_scale: 667.85181
    weight_scale: 209.34697
    weight_scale: 436.83618
    data_scale: 14.221051
    int8_term: true
  }
}
layer {
  name: "conv4/relu"
  type: "ReLU"
  bottom: "conv4"
  top: "conv4"
}
layer {
  name: "conv5/dw"
  type: "ConvolutionRistretto"
  bottom: "conv4"
  top: "conv5/dw"
  param {
    lr_mult: 0.1
    decay_mult: 0.1
  }
  convolution_param {
    num_output: 256
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 256
    weight_filler {
      type: "msra"
    }
  }
  quantization_param {
    weight_scale: 150.7355
    weight_scale: 99.049286
    weight_scale: 122.30977
    weight_scale: 96.817787
    weight_scale: 83.88533
    weight_scale: 176.8098
    weight_scale: 183.80965
    weight_scale: 98.030754
    weight_scale: 496.6673
    weight_scale: 70.290665
    weight_scale: 64.389549
    weight_scale: 131.09357
    weight_scale: 67.374664
    weight_scale: 279.06219
    weight_scale: 196.63916
    weight_scale: 219.52576
    weight_scale: 339.58646
    weight_scale: 104.71716
    weight_scale: 109.88743
    weight_scale: 287.29321
    weight_scale: 70.31942
    weight_scale: 110.16192
    weight_scale: 126.25462
    weight_scale: 101.37218
    weight_scale: 185.23897
    weight_scale: 67.054253
    weight_scale: 200.15742
    weight_scale: 131.03455
    weight_scale: 125.99171
    weight_scale: 111.70247
    weight_scale: 121.60077
    weight_scale: 178.35617
    weight_scale: 184.11319
    weight_scale: 199.73634
    weight_scale: 379.67224
    weight_scale: 79.859879
    weight_scale: 67.057068
    weight_scale: 198.40344
    weight_scale: 92.667664
    weight_scale: 191.46085
    weight_scale: 45.12014
    weight_scale: 54.357368
    weight_scale: 488.91751
    weight_scale: 431.20496
    weight_scale: 167.57576
    weight_scale: 53.982895
    weight_scale: 123.12431
    weight_scale: 329.25452
    weight_scale: 180.88174
    weight_scale: 51.605034
    weight_scale: 188.79456
    weight_scale: 188.37708
    weight_scale: 331.12683
    weight_scale: 291.45874
    weight_scale: 82.007591
    weight_scale: 131.7489
    weight_scale: 645.86719
    weight_scale: 114.6181
    weight_scale: 225.24355
    weight_scale: 139.82671
    weight_scale: 54.709064
    weight_scale: 107.63624
    weight_scale: 63.587063
    weight_scale: 200.645
    weight_scale: 110.04062
    weight_scale: 75.440605
    weight_scale: 40.7863
    weight_scale: 150.16035
    weight_scale: 91.782364
    weight_scale: 181.06064
    weight_scale: 153.78845
    weight_scale: 159.88156
    weight_scale: 164.57799
    weight_scale: 158.51804
    weight_scale: 609.10968
    weight_scale: 41.894138
    weight_scale: 88.343071
    weight_scale: 151.21039
    weight_scale: 51.889919
    weight_scale: 417.25705
    weight_scale: 222.88077
    weight_scale: 21.321894
    weight_scale: 81.388184
    weight_scale: 252.75827
    weight_scale: 582.07367
    weight_scale: 179.29985
    weight_scale: 187.97096
    weight_scale: 109.67932
    weight_scale: 67.9129
    weight_scale: 548.4989
    weight_scale: 247.1581
    weight_scale: 149.40749
    weight_scale: 157.74257
    weight_scale: 135.814
    weight_scale: 92.731583
    weight_scale: 194.11209
    weight_scale: 49.965511
    weight_scale: 93.2136
    weight_scale: 61.441513
    weight_scale: 123.61794
    weight_scale: 204.36394
    weight_scale: 152.57741
    weight_scale: 78.756958
    weight_scale: 495.57196
    weight_scale: 67.5441
    weight_scale: 291.29279
    weight_scale: 52.80175
    weight_scale: 340.04553
    weight_scale: 59.273064
    weight_scale: 80.600769
    weight_scale: 143.76981
    weight_scale: 154.93391
    weight_scale: 210.47119
    weight_scale: 52.267521
    weight_scale: 219.38271
    weight_scale: 116.69038
    weight_scale: 143.44003
    weight_scale: 212.19016
    weight_scale: 62.744747
    weight_scale: 294.96585
    weight_scale: 106.94562
    weight_scale: 134.93732
    weight_scale: 71.972824
    weight_scale: 195.15695
    weight_scale: 137.88737
    weight_scale: 77.771378
    weight_scale: 77.228821
    weight_scale: 69.51181
    weight_scale: 295.14029
    weight_scale: 73.316925
    weight_scale: 117.44801
    weight_scale: 650.72797
    weight_scale: 151.27483
    weight_scale: 136.49065
    weight_scale: 77.037392
    weight_scale: 135.07919
    weight_scale: 459.77359
    weight_scale: 605.8548
    weight_scale: 72.320366
    weight_scale: 154.6575
    weight_scale: 79.114273
    weight_scale: 75.78653
    weight_scale: 81.511528
    weight_scale: 71.325714
    weight_scale: 150.39085
    weight_scale: 90.128021
    weight_scale: 127.43177
    weight_scale: 107.32409
    weight_scale: 224.73325
    weight_scale: 69.477776
    weight_scale: 51.112473
    weight_scale: 269.15811
    weight_scale: 80.813385
    weight_scale: 203.99507
    weight_scale: 76.697472
    weight_scale: 150.20039
    weight_scale: 195.0956
    weight_scale: 108.93108
    weight_scale: 171.18021
    weight_scale: 165.76024
    weight_scale: 292.12994
    weight_scale: 58.245239
    weight_scale: 474.05881
    weight_scale: 104.82703
    weight_scale: 201.34055
    weight_scale: 88.263969
    weight_scale: 726.26685
    weight_scale: 74.799286
    weight_scale: 316.04691
    weight_scale: 142.67091
    weight_scale: 287.46155
    weight_scale: 150.6442
    weight_scale: 140.58926
    weight_scale: 112.57511
    weight_scale: 732.09888
    weight_scale: 96.338882
    weight_scale: 177.98953
    weight_scale: 153.11536
    weight_scale: 71.170868
    weight_scale: 72.636894
    weight_scale: 267.05637
    weight_scale: 102.41497
    weight_scale: 292.28159
    weight_scale: 112.67944
    weight_scale: 242.41765
    weight_scale: 51.440022
    weight_scale: 108.70667
    weight_scale: 67.324783
    weight_scale: 87.770569
    weight_scale: 142.93852
    weight_scale: 155.78055
    weight_scale: 129.80307
    weight_scale: 155.57623
    weight_scale: 413.0293
    weight_scale: 226.41628
    weight_scale: 105.5407
    weight_scale: 72.275711
    weight_scale: 194.02634
    weight_scale: 134.87234
    weight_scale: 172.13116
    weight_scale: 61.756306
    weight_scale: 244.36591
    weight_scale: 243.72713
    weight_scale: 107.69894
    weight_scale: 155.48201
    weight_scale: 66.50589
    weight_scale: 70.870544
    weight_scale: 171.93634
    weight_scale: 124.87695
    weight_scale: 151.03337
    weight_scale: 158.79692
    weight_scale: 110.66685
    weight_scale: 71.897392
    weight_scale: 150.087
    weight_scale: 86.137932
    weight_scale: 189.53435
    weight_scale: 118.8887
    weight_scale: 37.544182
    weight_scale: 155.9545
    weight_scale: 177.23392
    weight_scale: 151.78503
    weight_scale: 101.80466
    weight_scale: 143.24588
    weight_scale: 138.3235
    weight_scale: 143.41635
    weight_scale: 151.94356
    weight_scale: 45.770763
    weight_scale: 63.02565
    weight_scale: 150.10382
    weight_scale: 51.340622
    weight_scale: 60.0459
    weight_scale: 153.97308
    weight_scale: 80.374275
    weight_scale: 206.98376
    weight_scale: 121.10827
    weight_scale: 98.786369
    weight_scale: 108.74135
    weight_scale: 172.38757
    weight_scale: 67.0975
    weight_scale: 85.759094
    weight_scale: 113.25961
    weight_scale: 106.16769
    weight_scale: 469.30222
    weight_scale: 138.23865
    weight_scale: 125.42664
    weight_scale: 242.2354
    weight_scale: 201.44095
    weight_scale: 112.17417
    weight_scale: 156.58659
    weight_scale: 60.745831
    weight_scale: 96.2169
    weight_scale: 212.93288
    weight_scale: 431.017
    weight_scale: 131.66785
    weight_scale: 259.58441
    weight_scale: 82.676704
    data_scale: 8.1309643
    int8_term: true
  }
}
layer {
  name: "conv5/dw/relu"
  type: "ReLU"
  bottom: "conv5/dw"
  top: "conv5/dw"
}
layer {
  name: "conv5"
  type: "ConvolutionRistretto"
  bottom: "conv5/dw"
  top: "conv5"
  param {
    lr_mult: 0.1
    decay_mult: 0.1
  }
  convolution_param {
    num_output: 256
    bias_term: true
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
  }
  quantization_param {
    weight_scale: 117.76922
    weight_scale: 248.9406
    weight_scale: 498.78189
    weight_scale: 421.17493
    weight_scale: 758.64532
    weight_scale: 457.1832
    weight_scale: 1131.2834
    weight_scale: 374.91263
    weight_scale: 338.12482
    weight_scale: 277.18762
    weight_scale: 400.75604
    weight_scale: 344.66583
    weight_scale: 429.17288
    weight_scale: 871.34393
    weight_scale: 597.41193
    weight_scale: 205.3261
    weight_scale: 479.5784
    weight_scale: 575.8562
    weight_scale: 370.91772
    weight_scale: 447.6701
    weight_scale: 367.56577
    weight_scale: 295.88184
    weight_scale: 0
    weight_scale: 886.6629
    weight_scale: 194.29837
    weight_scale: 255.44214
    weight_scale: 507.34247
    weight_scale: 417.34769
    weight_scale: 374.38138
    weight_scale: 339.14642
    weight_scale: 425.81754
    weight_scale: 183.0137
    weight_scale: 594.07068
    weight_scale: 492.95856
    weight_scale: 309.03311
    weight_scale: 376.15347
    weight_scale: 348.46826
    weight_scale: 217.93323
    weight_scale: 256.51385
    weight_scale: 698.78607
    weight_scale: 139.19455
    weight_scale: 260.82495
    weight_scale: 484.56281
    weight_scale: 257.23929
    weight_scale: 257.34821
    weight_scale: 465.75418
    weight_scale: 516.6615
    weight_scale: 884.89423
    weight_scale: 463.35263
    weight_scale: 244.65662
    weight_scale: 446.28961
    weight_scale: 282.46811
    weight_scale: 343.05637
    weight_scale: 217.63626
    weight_scale: 341.082
    weight_scale: 362.47806
    weight_scale: 592.49615
    weight_scale: 733.97766
    weight_scale: 411.4151
    weight_scale: 337.68402
    weight_scale: 372.32043
    weight_scale: 303.93274
    weight_scale: 312.04013
    weight_scale: 798.99951
    weight_scale: 770.43292
    weight_scale: 287.6123
    weight_scale: 405.43619
    weight_scale: 213.199
    weight_scale: 223.11723
    weight_scale: 853.55341
    weight_scale: 397.91559
    weight_scale: 757.88971
    weight_scale: 395.7608
    weight_scale: 763.04205
    weight_scale: 301.44519
    weight_scale: 499.45703
    weight_scale: 387.23364
    weight_scale: 367.01453
    weight_scale: 292.04395
    weight_scale: 347.03604
    weight_scale: 679.19757
    weight_scale: 524.9679
    weight_scale: 665.42487
    weight_scale: 372.2355
    weight_scale: 388.40396
    weight_scale: 482.23303
    weight_scale: 511.10858
    weight_scale: 444.48358
    weight_scale: 1293.8003
    weight_scale: 187.95496
    weight_scale: 284.23129
    weight_scale: 611.38654
    weight_scale: 576.22656
    weight_scale: 564.54761
    weight_scale: 286.86725
    weight_scale: 381.02795
    weight_scale: 275.92041
    weight_scale: 299.71039
    weight_scale: 420.78812
    weight_scale: 509.24588
    weight_scale: 304.28806
    weight_scale: 361.35504
    weight_scale: 440.99945
    weight_scale: 346.59946
    weight_scale: 471.95605
    weight_scale: 521.32251
    weight_scale: 664.67407
    weight_scale: 450.83624
    weight_scale: 340.03964
    weight_scale: 563.31427
    weight_scale: 553.69238
    weight_scale: 460.53198
    weight_scale: 602.14734
    weight_scale: 356.2789
    weight_scale: 447.93417
    weight_scale: 422.35989
    weight_scale: 268.64655
    weight_scale: 553.00696
    weight_scale: 458.22733
    weight_scale: 445.8876
    weight_scale: 666.2348
    weight_scale: 294.65207
    weight_scale: 171.95296
    weight_scale: 423.65793
    weight_scale: 282.4523
    weight_scale: 321.90509
    weight_scale: 453.682
    weight_scale: 593.54871
    weight_scale: 430.09662
    weight_scale: 180.81032
    weight_scale: 561.13074
    weight_scale: 480.65967
    weight_scale: 556.22327
    weight_scale: 150.57158
    weight_scale: 401.98425
    weight_scale: 262.81027
    weight_scale: 231.03154
    weight_scale: 628.56854
    weight_scale: 275.98187
    weight_scale: 483.24225
    weight_scale: 776.59595
    weight_scale: 244.36481
    weight_scale: 422.04211
    weight_scale: 338.1402
    weight_scale: 378.27206
    weight_scale: 306.36227
    weight_scale: 400.85974
    weight_scale: 388.97446
    weight_scale: 349.28131
    weight_scale: 301.11136
    weight_scale: 253.86829
    weight_scale: 295.22672
    weight_scale: 436.94107
    weight_scale: 397.35327
    weight_scale: 455.80331
    weight_scale: 680.25354
    weight_scale: 619.48413
    weight_scale: 416.17221
    weight_scale: 361.57285
    weight_scale: 506.40146
    weight_scale: 360.80072
    weight_scale: 256.36526
    weight_scale: 413.37009
    weight_scale: 391.88785
    weight_scale: 547.392
    weight_scale: 386.79941
    weight_scale: 297.0228
    weight_scale: 352.87915
    weight_scale: 225.35588
    weight_scale: 173.19022
    weight_scale: 250.33704
    weight_scale: 231.32117
    weight_scale: 1150.579
    weight_scale: 235.20148
    weight_scale: 258.26724
    weight_scale: 386.582
    weight_scale: 139.41139
    weight_scale: 309.344
    weight_scale: 1107.3381
    weight_scale: 439.2341
    weight_scale: 363.53152
    weight_scale: 291.83688
    weight_scale: 379.18167
    weight_scale: 615.02582
    weight_scale: 475.45605
    weight_scale: 267.97556
    weight_scale: 394.2395
    weight_scale: 383.62228
    weight_scale: 284.2067
    weight_scale: 225.45868
    weight_scale: 205.57356
    weight_scale: 287.70651
    weight_scale: 300.26569
    weight_scale: 859.10803
    weight_scale: 439.46014
    weight_scale: 906.95483
    weight_scale: 191.07616
    weight_scale: 458.59558
    weight_scale: 772.20966
    weight_scale: 432.7085
    weight_scale: 583.12842
    weight_scale: 521.75977
    weight_scale: 160.34634
    weight_scale: 546.36975
    weight_scale: 497.94571
    weight_scale: 284.36438
    weight_scale: 443.88644
    weight_scale: 466.18024
    weight_scale: 313.96829
    weight_scale: 292.01666
    weight_scale: 257.83643
    weight_scale: 441.52115
    weight_scale: 301.37924
    weight_scale: 272.84875
    weight_scale: 408.3338
    weight_scale: 457.46512
    weight_scale: 170.3604
    weight_scale: 350.23584
    weight_scale: 245.71227
    weight_scale: 670.95459
    weight_scale: 119.09996
    weight_scale: 577.0752
    weight_scale: 347.73825
    weight_scale: 338.64114
    weight_scale: 158.11813
    weight_scale: 746.54376
    weight_scale: 553.91486
    weight_scale: 419.40076
    weight_scale: 245.2662
    weight_scale: 322.52405
    weight_scale: 226.22903
    weight_scale: 257.84845
    weight_scale: 232.15204
    weight_scale: 462.61349
    weight_scale: 348.31708
    weight_scale: 296.80414
    weight_scale: 479.44778
    weight_scale: 142.5898
    weight_scale: 490.62033
    weight_scale: 219.11459
    weight_scale: 321.00851
    weight_scale: 190.53189
    weight_scale: 434.67184
    weight_scale: 304.37137
    weight_scale: 470.32913
    weight_scale: 279.08313
    weight_scale: 171.11012
    weight_scale: 550.97571
    weight_scale: 315.19644
    weight_scale: 191.89391
    weight_scale: 1152.4291
    weight_scale: 517.92291
    weight_scale: 243.58093
    weight_scale: 318.88669
    weight_scale: 0
    weight_scale: 401.39447
    data_scale: 12.534636
    int8_term: true
  }
}
layer {
  name: "conv5/relu"
  type: "ReLU"
  bottom: "conv5"
  top: "conv5"
}
layer {
  name: "conv6/dw"
  type: "ConvolutionRistretto"
  bottom: "conv5"
  top: "conv6/dw"
  param {
    lr_mult: 0.1
    decay_mult: 0.1
  }
  convolution_param {
    num_output: 256
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 256
    stride: 2
    weight_filler {
      type: "msra"
    }
  }
  quantization_param {
    weight_scale: 591.71136
    weight_scale: 452.80444
    weight_scale: 218.75276
    weight_scale: 476.56198
    weight_scale: 176.40216
    weight_scale: 393.54251
    weight_scale: 82.24308
    weight_scale: 426.34952
    weight_scale: 290.2739
    weight_scale: 272.69446
    weight_scale: 301.64532
    weight_scale: 324.73355
    weight_scale: 437.30957
    weight_scale: 234.37103
    weight_scale: 112.35703
    weight_scale: 708.17877
    weight_scale: 290.82465
    weight_scale: 189.41072
    weight_scale: 164.94907
    weight_scale: 126.30622
    weight_scale: 249.32852
    weight_scale: 347.9613
    weight_scale: 0
    weight_scale: 150.03217
    weight_scale: 675.66815
    weight_scale: 574.33649
